# https://www.maff.go.jp/j/tokei/kouhyou/sakumotu/
# https://www.e-stat.go.jp/stat-search/files?page=1&layout=datalist&toukei=00500215&tstat=000001013427&cycle=7&year=20180&month=0&tclass1=000001032287&tclass2=000001032927&tclass3=000001134463
# https://uub.jp/pdr/
# https://news.livedoor.com/article/detail/13320505/
# https://origamijapan.net/origami/2018/05/14/onsen-area-list/
class window.Data
  #@pref_code = {
  #  '北海道':1,'青森県'：2,'岩手県':3,'宮城県':4,'秋田県':5,'山形県':6,'福島県':7,
  #  '茨城県':8,'栃木県'：9,'群馬県':10,'埼玉県':11,'千葉県':12,'東京都':13,'神奈川':14,
  #  '新潟県':15,'富山県'：16,'石川県':17,'福井県':18,'山梨県':19,'長野県':20,
  #  '岐阜県':21,'静岡県'：22,'愛知県':23,'三重県':24,
  #  '滋賀県':25,'京都府'：26,'大阪府':27,'兵庫県':28,'奈良県':29,'和歌山':30,
  #  '鳥取県':31,'島根県'：32,'岡山県':33,'広島県':34,'山口県':35,
  #  '徳島県':36,'香川県'：37,'愛媛県':38,'高知県':39,
  #  '福岡県':40,'佐賀県'：41,'長崎県':42,'熊本県':43,'大分県':44,'宮崎県':45,'鹿児島県':46,'沖縄県':47
  #}

  master_pref = '北海道,青森県,岩手県,宮城県,秋田県,山形県,福島県,茨城県,栃木県,群馬県,埼玉県,千葉県,東京都,神奈川,新潟県,富山県,石川県,福井県,山梨県,長野県,岐阜県,静岡県,愛知県,三重県,滋賀県,京都府,大阪府,兵庫県,奈良県,和歌山,鳥取県,島根県,岡山県,広島県,山口県,徳島県,香川県,愛媛県,高知県,福岡県,佐賀県,長崎県,熊本県,大分県,宮崎県,鹿児島,沖縄県'
  master_card = {}
  master_rank = {}
  master_value = {}
  master_unit = {}

  # 2014 https://origamijapan.net/origami/2018/05/14/onsen-area-list/
  master_card['onsen'] = '温泉地数'
  master_rank['onsen'] = '北海道,長野県,新潟県,福島県,青森県,秋田県,静岡県,群馬県,鹿児島,千葉県,山形県,宮城県,兵庫県,岩手県,富山県,栃木県,三重県,岐阜県,広島県,大分県,熊本県,石川県,福岡県,和歌山,山口県,島根県,福井県,京都府,大阪府,岡山県,茨城県,宮崎県,愛媛県,高知県,神奈川,愛知県,奈良県,長崎県,徳島県,山梨県,香川県,東京都,埼玉県,佐賀県,滋賀県,鳥取県,沖縄県'
  master_value['onsen'] = '246,221,151,134,132,125,119,103,100,94,88,82,76,75,73,69,68,67,63,63,54,53,52,51,51,44,40,39,39,38,36,36,35,35,34,33,32,32,30,28,27,26,25,24,22,15,8'
  master_unit['onsen'] = '箇所'

  # https://prefecture.gontawan.com/ranking_area.html
  #master_card['menseki'] = '面積'
  #master_rank['menseki'] = '北海道,岩手県,福島県,長野県,新潟県,秋田県,岐阜県,青森県,山形県,鹿児島,広島県,兵庫県,静岡県,宮崎県,熊本県,宮城県,岡山県,高知県,島根県,栃木県,群馬県,大分県,山口県,茨城県,三重県,愛媛県,愛知県,千葉県,福岡県,和歌山,京都府,山梨県,富山県,福井県,石川県,徳島県,長崎県,滋賀県,埼玉県,奈良県,鳥取県,佐賀県,神奈川,沖縄県,東京都,大阪府,香川県'
  # 生活満足度ランキング https://diamond.jp/articles/-/228904
  # https://uub.jp/rnk/p_j.html
  #master_card['jinkou'] = '人口'
  #master_rank['jinkou'] = '東京都,神奈川,大阪府,愛知県,埼玉県,千葉県,兵庫県,北海道,福岡県,静岡県,茨城県,広島県,京都府,宮城県,新潟県,長野県,岐阜県,栃木県,群馬県,岡山県,福島県,三重県,熊本県,鹿児島,沖縄県,滋賀県,山口県,愛媛県,奈良県,長崎県,青森県,岩手県,石川県,大分県,山形県,宮崎県,富山県,秋田県,香川県,和歌山,佐賀県,山梨県,福井県,徳島県,高知県,島根県,鳥取県'
  # 人口密度 https://uub.jp/rnk/p_j.html
  master_card['mitudo'] = '人口密度'
  master_rank['mitudo'] = '東京都,大阪府,神奈川,埼玉県,愛知県,千葉県,福岡県,兵庫県,沖縄県,京都府,香川県,茨城県,静岡県,奈良県,滋賀県,佐賀県,広島県,長崎県,宮城県,三重県,群馬県,栃木県,石川県,岡山県,富山県,愛媛県,熊本県,山口県,和歌山,岐阜県,福井県,山梨県,大分県,新潟県,徳島県,鹿児島,鳥取県,長野県,宮崎県,福島県,青森県,山形県,島根県,高知県,秋田県,岩手県,北海道'
  master_value['mitudo'] = '6354.79,4631.03,3807.54,1932.02,1460.04,1217.43,1024.79,650.36,637.52,560.07,509.42,470.37,467.93,360.7,351.96,333.6,331.14,320.8,316.27,308.21,304.55,303.1,271.66,265.85,245.55,235.87,235.74,221.76,195.51,187.26,183.21,181.86,178.91,176.57,175.71,174.16,158.44,151.09,138.59,134.07,129.19,115.53,100.46,98.21,83,80.29,66.93'
  master_unit['unit'] = '人/平方キロメートル'

  # 人口増加率 https://uub.jp/rnk/p_l.html
  #master_card['jinkou_zoukaritu'] = '人口増加率'
  #master_rank['jinkou_zoukaritu'] = '東京都,沖縄県,埼玉県,愛知県,千葉県,神奈川,福岡県,滋賀県,大阪府,京都府,広島県,兵庫県,宮城県,石川県,岡山県,栃木県,静岡県,茨城県,群馬県,三重県,香川県,岐阜県,富山県,熊本県,佐賀県,長野県,福井県,奈良県,北海道,山梨県,大分県,宮崎県,鹿児島,島根県,鳥取県,愛媛県,福島県,山口県,新潟県,徳島県,長崎県,和歌山,岩手県,山形県,高知県,青森県,秋田県'

  # 2018  https://uub.jp/
  master_card['hurusato'] = 'ふるさと納税の寄付受け入れ総額'
  master_rank['hurusato'] = '北海道,佐賀県,宮崎県,山形県,大阪府,静岡県,鹿児島,福岡県,長野県,岐阜県,高知県,和歌山,茨城県,長崎県,神奈川,兵庫県,岡山県,新潟県,大分県,熊本県,愛知県,群馬県,千葉県,山梨県,青森県,岩手県,宮城県,鳥取県,滋賀県,島根県,福島県,三重県,香川県,沖縄県,愛媛県,秋田県,東京都,埼玉県,石川県,山口県,福井県,栃木県,奈良県,広島県,京都府,徳島県,富山県'
  master_value['hurusato'] = '36502923,31546579,24902589,22610818,20074677,18550426,18153182,16474516,13462720,10893404,10686943,10346409,8990527,8348904,7359727,6978618,6926678,6431436,6325634,5384511,5383523,4878936,4845888,4440424,3855779,3675698,3586741,3558942,3491815,3240961,3084221,2945063,2926082,2673525,2437940,2270836,2266755,2263862,1927084,1815336,1747410,1506614,1477407,1456451,1339327,826232,442594'
  master_unit['hurusato'] = '円'
  # 2018
  master_card['miryoku'] = '魅力度'
  master_rank['miryoku'] = '北海道,京都府,東京都,沖縄県,神奈川,奈良県,大阪府,福岡県,長野県,長崎県,石川県,兵庫県,静岡県,宮城県,愛知県,千葉県,広島県,鹿児島,青森県,宮崎県,熊本県,富山県,大分県,秋田県,山梨県,岩手県,福島県,愛媛県,三重県,山形県,新潟県,島根県,高知県,岡山県,香川県,和歌山,山口県,滋賀県,福井県,岐阜県,鳥取県,群馬県,埼玉県,栃木県,佐賀県,徳島県,茨城県'
  master_value['miryoku'] = '60.3,52.2,41.9,41.2,36.7,32.6,31.8,28.1,26.4,26.3,25.7,24.7,24.3,23.5,23.2,21.1,20.2,20.1,19,18.8,18.7,18.5,17.9,16.9,16.5,15.8,15.7,15.7,15.4,15.3,15.2,14.8,14.8,14.4,14.4,14,14,13.9,13.3,13,12.9,11.8,11.4,11.3,11.3,9.8,8'
  master_unit['miryoku'] = 'ポイント'
  # 2014
  master_card['washlet'] = '温水便座普及率'
  master_rank['washlet'] = '滋賀県,富山県,福井県,岐阜県,新潟県,群馬県,奈良県,北海道,栃木県,石川県,長野県,兵庫県,茨城県,三重県,徳島県,山形県,香川県,山梨県,広島県,千葉県,静岡県,埼玉県,京都府,愛知県,秋田県,岡山県,鳥取県,神奈川,宮城県,大阪府,愛媛県,熊本県,福島県,島根県,和歌山,福岡県,佐賀県,東京都,山口県,大分県,宮崎県,鹿児島,青森県,岩手県,長崎県,高知県,沖縄県'
  master_value['washlet'] = '77.8,75.8,74.9,73.4,72.2,71.4,70.9,70.3,70.2,70,69.5,69.2,69.1,69,68.9,68.6,68.5,67.5,67.1,66.8,65.9,65.7,65.4,65,64.5,63.6,63.3,63.2,63,62.8,62.6,61.5,61.2,61.2,61.1,60.1,59.8,59.7,59.7,59.6,58.4,56.8,56.5,54.5,50.4,48.2,24.2'
  master_unit['washlet'] = '%'
  # 2019
  master_card['seven'] = 'セブンイレブン店舗数'
  master_rank['seven'] = '東京都,神奈川,大阪府,埼玉県,千葉県,愛知県,福岡県,北海道,静岡県,兵庫県,茨城県,広島県,群馬県,長野県,福島県,栃木県,新潟県,宮城県,京都府,熊本県,山口県,岡山県,滋賀県,山梨県,鹿児島,長崎県,岐阜県,宮崎県,佐賀県,山形県,三重県,大分県,岩手県,奈良県,石川県,富山県,愛媛県,秋田県,香川県,青森県,徳島県,和歌山,福井県,島根県,高知県,鳥取県,沖縄県'
  master_value['seven'] = '2743,1444,1256,1217,1121,1063,1016,1010,741,710,647,595,469,467,450,444,428,407,355,349,332,307,242,210,203,199,198,198,193,183,175,175,148,141,138,133,120,108,102,91,87,84,69,61,41,34,0'
  master_unit['seven'] = '件'
  # 2019
  master_card['lawson'] = 'ローソン店舗数'
  master_rank['lawson'] = '東京都,大阪府,神奈川,愛知県,埼玉県,兵庫県,北海道,千葉県,福岡県,京都府,静岡県,青森県,群馬県,宮城県,広島県,沖縄県,新潟県,茨城県,愛媛県,栃木県,岡山県,鹿児島,富山県,秋田県,大分県,岐阜県,岩手県,長野県,福島県,滋賀県,熊本県,和歌山,島根県,三重県,鳥取県,奈良県,高知県,徳島県,山梨県,香川県,山口県,福井県,山形県,長崎県,宮崎県,石川県,佐賀県'
  master_value['lawson'] = '1743,1153,1124,731,707,684,670,617,523,332,282,263,255,253,233,231,229,223,219,202,202,197,193,189,189,182,179,176,159,159,157,152,149,142,142,140,139,138,136,133,116,114,113,111,106,102,74'
  master_unit['lawson'] = '件'
  # 2019
  master_card['famima'] = 'ファミリーマート店舗数'
  master_rank['famima'] = '東京都,愛知県,大阪府,神奈川,埼玉県,千葉県,兵庫県,福岡県,静岡県,三重県,宮城県,岐阜県,茨城県,沖縄県,京都府,鹿児島,広島県,長野県,石川県,岡山県,北海道,愛媛県,栃木県,青森県,熊本県,岩手県,福島県,新潟県,滋賀県,富山県,長崎県,福井県,秋田県,山形県,奈良県,香川県,宮崎県,群馬県,大分県,和歌山,高知県,山口県,徳島県,山梨県,佐賀県,鳥取県,島根県'
  master_value['famima'] = '2423,1561,1345,983,775,619,530,523,489,393,347,338,329,326,321,274,266,263,246,235,234,234,220,200,195,184,178,176,158,155,152,150,148,144,143,124,124,120,118,115,103,89,83,80,72,69,66'
  master_unit['famima'] = '件'
  # 2013
  master_card['beer'] = '成人一人あたりのビール販売量'
  master_rank['beer'] = '東京都,大阪府,高知県,新潟県,京都府,富山県,北海道,宮城県,石川県,福井県,秋田県,岩手県,福島県,愛知県,青森県,山形県,広島県,福岡県,長野県,鳥取県,愛媛県,兵庫県,島根県,香川県,宮崎県,長崎県,和歌山,静岡県,神奈川,大分県,熊本県,徳島県,山口県,山梨県,佐賀県,三重県,栃木県,岐阜県,茨城県,群馬県,千葉県,鹿児島,岡山県,埼玉県,滋賀県,沖縄県,奈良県'
  master_value['beer'] = '43,30.4,29.4,28.7,28.5,27.7,27.3,27.3,26.6,26.2,26,25.8,25.5,25.2,25.1,25.1,24.8,24.3,24.3,23.9,23.9,23.8,23.4,23.3,22.6,22.4,22.4,22.2,22.2,22,22,21.9,21.8,21.5,21.4,21.3,21,20.3,20,19.7,19.4,18.8,18.8,18.2,17.9,17.9,17.6'
  master_unit['beer'] = 'リットル'
  # 2013
  master_card['happousyu'] = '成人一人あたりの発泡酒販売量'
  master_rank['happousyu'] = '沖縄県,高知県,宮崎県,鹿児島,和歌山,福井県,青森県,広島県,熊本県,大阪府,山口県,佐賀県,福岡県,長崎県,鳥取県,大分県,京都府,兵庫県,徳島県,富山県,北海道,新潟県,秋田県,島根県,愛媛県,宮城県,石川県,岩手県,岡山県,愛知県,香川県,福島県,東京都,奈良県,三重県,岐阜県,神奈川,滋賀県,静岡県,群馬県,長野県,山形県,千葉県,埼玉県,山梨県,茨城県,栃木県'
  master_value['happousyu'] = '17.8,16.9,11.5,10.9,10.2,9.8,9.7,9.6,9.4,9.3,9.2,9,9,9,8.4,8.4,8.3,8.3,8.1,8.1,7.9,7.9,7.8,7.8,7.8,7.3,7.2,7,6.8,6.7,6.6,6.6,6.5,6.2,6.2,6,5.8,5.7,5.6,5.6,5.5,5.4,5.2,5.2,5,4.9,4.8'
  master_unit['happousyu'] = 'リットル'

  # 2018 https://www.e-stat.go.jp/regional-statistics/ssdsview/prefectures/rank
  master_card['f_jinkou'] = '外国人人口'
  master_rank['f_jinkou'] = '東京都,愛知県,大阪府,神奈川,埼玉県,千葉県,兵庫県,静岡県,福岡県,京都府,茨城県,群馬県,岐阜県,広島県,三重県,長野県,栃木県,北海道,滋賀県,岡山県,宮城県,新潟県,山口県,山梨県,沖縄県,富山県,福井県,石川県,奈良県,福島県,大分県,熊本県,愛媛県,長崎県,香川県,鹿児島,山形県,島根県,岩手県,和歌山,佐賀県,徳島県,宮崎県,青森県,鳥取県,高知県,秋田県'
  master_value['f_jinkou'] = '378564,166150,150890,144500,105203,90178,77518,59596,47097,43949,41310,37126,35382,34854,31333,26640,26494,21676,19886,17309,13989,11567,11512,11115,11020,10768,9448,9308,8726,8725,8656,8358,8096,7669,6928,5847,5503,5371,5017,4667,3878,3871,3693,3447,3384,3236,2914'
  master_unit['f_jinkou'] = '人'
  # 2018 
  master_card['sunny'] = '年間快晴日数'
  master_rank['sunny'] = '宮崎県,静岡県,埼玉県,三重県,茨城県,岐阜県,高知県,佐賀県,山梨県,岡山県,愛知県,広島県,熊本県,徳島県,群馬県,東京都,神奈川,山口県,福岡県,大分県,鹿児島,愛媛県,長崎県,千葉県,大阪府,栃木県,奈良県,和歌山,滋賀県,兵庫県,香川県,島根県,福井県,鳥取県,長野県,京都府,宮城県,石川県,富山県,福島県,新潟県,北海道,秋田県,青森県,岩手県,山形県,沖縄県'
  master_value['sunny'] = '67,64,47,45,44,43,42,41,38,38,37,37,37,35,34,34,34,34,34,34,34,33,31,30,29,28,28,28,26,26,26,23,22,22,21,21,20,17,16,14,12,10,9,8,8,8,5'
  master_unit['sunny'] = '日'
  # 2018
  master_card['rain'] = '年間降水日数'
  master_rank['rain'] = '石川県,富山県,福井県,新潟県,青森県,秋田県,北海道,鳥取県,島根県,山形県,宮崎県,沖縄県,滋賀県,岩手県,岐阜県,高知県,鹿児島,愛知県,福岡県,長野県,奈良県,三重県,山口県,京都府,長崎県,宮城県,茨城県,静岡県,徳島県,佐賀県,神奈川,東京都,福島県,栃木県,大分県,熊本県,兵庫県,千葉県,大阪府,群馬県,和歌山,香川県,愛媛県,埼玉県,山梨県,岡山県,広島県'
  master_value['rain'] = '185,179,175,173,172,168,157,152,148,137,131,128,127,120,114,114,114,111,111,110,110,108,108,107,107,106,106,106,106,105,104,103,101,101,101,100,97,96,96,94,94,94,90,86,84,84,81'
  master_unit['rain'] = '日'
  # 2017
  master_card['computer_s'] = '教育用コンピュータ1台当たりの児童数（小学校）'
  master_rank['computer_s'] = '埼玉県,愛知県,福岡県,神奈川県,千葉県,広島県,宮崎県,兵庫県,島根県,熊本県,宮城県,奈良県,静岡県,三重県,京都府,茨城県,沖縄県,群馬県,長野県,東京都,山口県,栃木県,石川県,香川県,北海道,山形県,秋田県,愛媛県,岩手県,富山県,岐阜県,青森県,福島県,新潟県,福井県,滋賀県,大阪府,大分県,高知県,鳥取県,長崎県,岡山県,和歌山県,山梨県,徳島県,佐賀県,鹿児島県'
  master_value['computer_s'] = '9.6,8.7,8.4,8.1,7.7,7.5,7.4,7.2,7.1,6.9,6.8,6.8,6.7,6.7,6.7,6.5,6.3,6.1,6.1,6,6,5.9,5.9,5.9,5.8,5.7,5.6,5.5,5.4,5.4,5.4,5.3,5.3,5.3,5.3,5.3,5.3,5.3,5,4.9,4.9,4.8,4.7,4.6,4,3.9,3.1'
  master_unit['computer_s'] = '人'
  # 2017
  master_card['computer_c'] = '教育用コンピュータ1台当たりの児童数（中学校）'
  master_rank['computer_c'] = '愛知県,埼玉県,神奈川,石川県,兵庫県,福岡県,千葉県,香川県,広島県,茨城県,富山県,宮城県,栃木県,静岡県,奈良県,長野県,大阪府,山形県,群馬県,三重県,宮崎県,沖縄県,愛媛県,滋賀県,京都府,東京都,岩手県,福島県,岡山県,徳島県,北海道,青森県,新潟県,山梨県,岐阜県,熊本県,大分県,福井県,鳥取県,島根県,山口県,秋田県,和歌山,長崎県,高知県,鹿児島,佐賀県'
  master_value['computer_c'] = '7.9,7.6,7.4,6.9,6.9,6.9,6.6,6.4,6.2,6.1,6.1,5.9,5.9,5.8,5.8,5.6,5.6,5.5,5.5,5.5,5.3,5.3,5.2,5.1,5.1,5,4.8,4.7,4.7,4.7,4.6,4.6,4.6,4.5,4.5,4.5,4.5,4.4,4.3,4.3,4.3,3.9,3.9,3.9,3.2,3.1,2.7'
  master_unit['computer_c'] = '人'
  # 2017
  master_card['computer_k'] = '教育用コンピュータ1台当たりの児童数（高等学校）'
  master_rank['computer_k'] = '千葉県,神奈川,香川県,群馬県,新潟県,長野県,愛知県,福岡県,滋賀県,広島県,栃木県,埼玉県,和歌山,富山県,京都府,奈良県,福島県,岐阜県,三重県,静岡県,鹿児島,北海道,秋田県,茨城県,東京都,兵庫県,青森県,岩手県,愛媛県,宮城県,島根県,岡山県,宮崎県,石川県,大阪府,山梨県,徳島県,沖縄県,長崎県,福井県,山口県,熊本県,大分県,山形県,高知県,鳥取県,佐賀県'
  master_value['computer_k'] = '9.9,7.3,6.9,6.5,6.5,6.3,6.3,6,5.9,5.9,5.7,5.5,5.5,5.2,5,5,4.8,4.7,4.7,4.6,4.6,4.5,4.5,4.5,4.5,4.5,4.3,4.3,4.3,4.2,4.2,4.2,4.2,4,3.9,3.8,3.6,3.6,3.5,3.4,3.4,3.4,3.2,3,2.9,2.4,0.8'
  master_unit['computer_k'] = '人'
  # 2018
  master_card['kouti'] = '耕地面積'
  master_rank['kouti'] = '北海道,新潟県,茨城県,青森県,岩手県,秋田県,福島県,宮城県,千葉県,栃木県,山形県,鹿児島,熊本県,長野県,福岡県,愛知県,埼玉県,兵庫県,群馬県,宮崎県,静岡県,岡山県,三重県,富山県,岐阜県,大分県,広島県,滋賀県,佐賀県,愛媛県,山口県,長崎県,石川県,福井県,沖縄県,島根県,鳥取県,和歌山,京都府,香川県,徳島県,高知県,山梨県,奈良県,神奈川,大阪府,東京都'
  master_value['kouti'] = '1145000,170100,166000,151000,150100,147600,140800,126900,125200,123200,117700,117100,111600,106700,81400,74900,74800,73800,68400,66400,65300,64600,58900,58400,56000,55400,54800,51700,51600,48500,47200,46600,41200,40200,38000,36800,34400,32400,30300,30200,29000,27400,23700,20500,19100,12800,6790'
  master_unit['kouti'] = 'ヘクタール'
  # 2018
  master_card['akiya'] = '空き家数'
  master_rank['akiya'] = '東京都,大阪府,神奈川,愛知県,千葉県,北海道,兵庫県,埼玉県,福岡県,静岡県,広島県,長野県,茨城県,京都府,鹿児島,栃木県,群馬県,新潟県,岡山県,岐阜県,宮城県,愛媛県,三重県,山口県,福島県,熊本県,長崎県,和歌山,大分県,岩手県,山梨県,青森県,香川県,奈良県,宮崎県,滋賀県,石川県,高知県,徳島県,沖縄県,秋田県,富山県,山形県,佐賀県,島根県,福井県,鳥取県'
  master_value['akiya'] = '809900,709400,484700,393800,382500,379800,360200,346200,328600,281600,215600,197300,197200,171800,167000,160700,158300,146200,142500,139800,130500,129800,129600,126800,123500,111900,101500,98400,97700,93500,90000,88700,88200,87200,84200,81200,77800,74600,74100,67900,60800,60000,54200,50500,48300,45000,39900'
  master_unit['akiya'] = '戸'
  # 2017
  master_card['recycle'] = 'ゴミのリサイクル率'
  master_rank['recycle'] = '鳥取県,山口県,岡山県,三重県,埼玉県,神奈川,北海道,富山県,熊本県,茨城県,千葉県,島根県,新潟県,東京都,愛知県,広島県,長野県,福岡県,佐賀県,高知県,大分県,香川県,滋賀県,岐阜県,岩手県,静岡県,福井県,愛媛県,宮崎県,兵庫県,徳島県,栃木県,奈良県,宮城県,山梨県,京都府,鹿児島,秋田県,沖縄県,群馬県,青森県,長崎県,山形県,石川県,大阪府,福島県,和歌山'
  master_value['recycle'] = '31.2,30.8,29.6,27.2,24.9,24.4,24.3,24.1,23.4,22.8,22.3,22.3,22.2,21.9,21.7,21.3,21.2,21,20.8,20.7,20.6,19.3,18.7,18.6,18.4,18.1,18,17.9,17.1,16.9,16.8,16.3,16.3,16,15.9,15.9,15.7,15.5,15.3,15.1,15,15,14.7,14.4,13.4,13.3,12.4'
  master_unit['recycle'] = '%'
  # 2017
  master_card['bycycle'] = '二輪車台数'
  master_rank['bycycle'] = '東京都,神奈川,大阪府,埼玉県,愛知県,兵庫県,千葉県,静岡県,北海道,福岡県,広島県,茨城県,京都府,長野県,沖縄県,宮城県,群馬県,栃木県,福島県,新潟県,鹿児島,岐阜県,岡山県,三重県,熊本県,長崎県,岩手県,滋賀県,愛媛県,奈良県,山梨県,山形県,和歌山,青森県,大分県,宮崎県,山口県,香川県,石川県,富山県,高知県,秋田県,佐賀県,徳島県,福井県,島根県,鳥取県'
  master_value['bycycle'] =  '157966,129587,99576,83905,76101,69101,63717,57598,49701,45941,35779,34319,32759,29626,29101,28127,27494,26776,24786,23713,21140,20534,20196,20168,18617,17366,15125,15050,14563,14529,13713,12036,11907,11900,11631,11327,11255,10808,10034,9690,9184,8404,7268,7236,6244,4814,4146'
  master_unit['bycycle'] = '台' 

  @pref_data = []
  data_array = master_pref.split(',')
  for v,k in data_array
    @pref_data.push v
    # todo リファクタリング
    #random_data_array.push v

  @card_data = {}
  for k,v of master_card
    @card_data[k] = v

  @rank_data = {}
  for k,v of master_rank
    data_array = v.split(',')
    data = {}
    for k2,v2 in data_array
      data[k2] = v2 + 1
    throw new Error "[001]" if Object.keys(data).length isnt 47
    @rank_data[k] = data

  @value_data = {}
  i = 0
  for k,v of master_value
    value_data_array = master_value[k].split(',')
    rank_data_array = master_rank[k].split(',')
    data = {}
    i++
    for v2,k2 in value_data_array
      data[rank_data_array[k2]] = v2
    @value_data[k] = data

  @unit_data = {}
  for k,v of master_unit
    @unit_data[k] = v 

  @initialize: ->
    $('.js-pref-list').html('')
    $('.js-card-list').html('')
    @random_pref_data = []
    random_data_array = []
    for v in @pref_data
      random_data_array.push v
    for v in @pref_data
      rand = Math.floor(Math.random() * Math.floor(@pref_data.length - @random_pref_data.length))
      @random_pref_data.push random_data_array[rand]
      random_data_array.splice(rand,1)

    @card_initialize()

    window.life = 3
    window.your_pref = null
    window.opponent_pref = null
    window.opponent_list = null
    window.theme = null

  @card_initialize: ->
    random_data_array = []
    window.card_list = []
    for k,v of @card_data
      random_data_array.push k
    for k,v of @card_data
      rand = Math.floor(Math.random() * Math.floor(Object.keys(@card_data).length - window.card_list.length))
      window.card_list.push random_data_array[rand]
      random_data_array.splice(rand,1)
    
